package animals;

//Структура класу: <модифікатор доступу> <інші модифікатори> class <назва класу> <тіло класу>

// <інші модифікатори>:
// abstract
// final
// abstract final 
// final abstract  
public abstract class Animal {

	// Структура змінної:
	// <модифікатор доступу> <інші модифікатори> <тип змінної> <назва змінної>
	// <інші модифікатори>:
	// final
	// static
	// transient
	// volatile
	// final static - означає, що змінна є константою. (Назва констант
	// складається з прописних літер,
	// слова відокремлюються нижнім підкресленням
	// final static transient
	// final transient
	// static final
	private int size;

	// 1. Назва конструктора така сама як назва класу
	/*
	 * 2. Структура конструктора: <модифікатор доступу> <назва, яка співпадає з
	 * назвою класу>(<параметри>) <тіло конструктора>
	 * 
	 * Параметри: <інші модифікатори> <тип> <псевдонім параметра> інші
	 * модифікатори: final або нічого
	 */
	public Animal(int size) {

	}

	/*
	 * 2. Структура функції: <модифікатор доступу> <інші модифікатори> <тип
	 * значення, яке функція віддає> <назва>(<параметри>) <тіло>
	 * 
	 * <інші модифікатори>: final static abstract
	 * 
	 * 
	 * тип значення, яке функція віддає: простий тип: від int до boolean Клас
	 * void - пусте значення
	 * 
	 * 
	 * 
	 * Параметри: <інші модифікатори> <тип> <псевдонім параметра> інші
	 * модифікатори: final або нічого
	 */
	public abstract void move(int steps);

	public int getSize() {
		return size;
	}

}
